package JavaCore;

public class Test {
    /*
КОММЕНТАРИИ.
Код программы может содержать комментарии. Комментарии позволяют понять смысл программы, что делают те или иные ее части.
В Java есть два типа комментариев: однострочный и многострочный:
*/

/*
    многострочный комментарий
    Объявление нового класса,
    который содержит код программы
*/
   // начало объявления класса Program
      
    // определение метода main
    public static void main (String args[]){    // объявление нового метода
          
         System.out.println("Hello Java!");     // вывод строки на консоль
    }   // конец объявления нового метода
    
// конец объявления класса Program

}
